// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// - створити функцію яка обчислює та повертає площу кола з радіусом r
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.


// function s(a, b){
//     sRectangle = a * b;
//     return sRectangle;
// }console.log(s(20, 40))


// function s(r) {
//     Pi = 3.14;
//     sCircle = Pi * Math.pow(r, 2);
//     return sCircle;
// }console.log(s(4))


// function s(r, h) {
//     Pi = 3.14;
//     sCylindre = 2 * Pi * r * h;
//     return sCylindre;
// }console.log(s(5,7))


// let arr = [25, 256, 79650, 7876, 34567, 965, 'ghjk'];
// function array(arr) {
//     for (i = 0; i < arr.length; i++){
//         console.log(arr[i])
//     }
// }array(arr)


// function p(txt) {
//     for (let i = 0; i<=50; i++){
//         document.write(`<p>${i} - ${txt}</p>`)
//     }
// }p('GHJKL GHJKLK')

